{
  "scraped_at": "2025-10-24T10:43:49.435982",
  "source": "Indeed.com",
  "search_query": "Goodwill Central Texas - Austin, TX",
  "total_jobs": 2,
  "jobs": [
    {
      "title": "Retail Assistant Manager",
      "company": "Goodwill Industries of Central Texas",
      "location": "Cedar Park, TX 78613",
      "salary": "Full-time",
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0B803KHqtEZFl1zjx0sr9b9AHQOUPBdCWdQu8UhUPBs8BOAFsyP5kgGHj5nWEyoAantf4biuhG_5YNfSr8BioEiuDxoUue0on6HZ7txOPTnhus3pMrkx9zZNHYDhKIWP2YiFndkKer4pxd9ePuLZ2q1bjtiBG1eTL7aXOnVBzy7GKuOzpsTpUZl5Olm-8tIJYnkvd_AR6f_Y3EKfGUp92DtfGkDGJ-VUEKvo4_GH5QTJDCP9JiGr6EHLZ2A0nWAu5WsM6XCjGn1Xh95D1aZvGOeTFD1u_ggD1SzzuHr3BBSPBWKND3ywEyKpalKoRFUKIebFjRjE8P0fhNV1ySJ6xFWFmMtE_xBFZHab_5LC6f6wTWKu4MaSyOt3xCWqXRvyIjX5LngJ6n_rin8bqjLdA7F6fTeUkU-ce5idewIG4ey4KS-DJcXz3I-zMAozOeTLHsybjh13kHNKOTRHaingHcCp7E322JGQqPsup3tmVXfHQe_17OoQBHSjcpJEX6bPsJtIf3WpzNCxp6avR7Fkl5I0tjh3uzKONZwRtdTxTnVpxtNCJAS4lZxJ-eT5-VQycPF4i6Lz_CJ94QyTGgosCEWj0KcIFVBAW2_PY_agLv0nmL-r7Ri_8LYQRZxoOEM6mXrFY3Fc1G4WFjng_yGHzgc3Hpw9AasMXHPmNnAR7ddm8p70irIY7MNKtyKLQq5SGMA4Jyq4Xyn0o0yheF678AN876HNOHid7oyyCkJRetyNoX3mqGfX8j6eoNh1SOdUJuphNRaczPXj1otEN3pWfB7gAYVNB_f7jJKchufg8zpbbXkBQtroWl0y-dHMzOSZeJJfUQM_P1cP7jPPZCXu-4RV_79GsKY2pE9vFS9FgjArtBzvLdnaICECoicX3yo_ycLvHczOEiwytiJE-KepC-GmOwd15m2L_77oSYLa4_L629q5wSq5ShQ1Fo6i97guRo=&xkcb=SoCr6_M3rLdpfFwHxB0LbzkdCdPP&camk=f416UQcMBpDvQZvZUIqV4A==&p=0&fvj=0&vjs=3",
      "description": "Assistant Store Manager – Lead With Purpose\n\nQuarterly Bonus Potential: Assistant Store Managers have the potential to earn up to a max of 12.5% of their quarterly salary based on performance in key metrics in their department.\n\nLooking to grow your retail career and earn a bonus while making a real difference in your community? We're hiring an enthusiastic, hands-on Assistant Store Manager to help lead our retail team. You’ll partner with the Retail General Manager to oversee daily operations, guide an amazing team, and create outstanding customer experience. When the GM’s away, you step in to keep everything running smoothly.\n\nWhat You’ll Be Doing:\n\nSupport the Retail GM in leading store operations, staffing, merchandising, and customer service.\nSupervise and mentor retail, donation, and production staff.\nManage scheduling, inventory control, cash handling, and store opening/closing.\nJump in on the floor when needed—assist donors, sort inventory, and serve customers.\nDrive store productivity while maintaining safety, cleanliness, and compliance.\nTake the lead on all store operations in the absence of the General Manager.\n\nWho You’ll Supervise:\n\nSales Associates, Merchandise Processors and Retail Supervisors. Your leadership will make a real impact on team performance and morale.\n\nWhat You Bring:\n\nHigh School diploma or equivalent; college a plus\n5+ years of experience in retail or similar roles\n2+ years in a supervisory or management position\nStrong organizational, scheduling, and communication skills\nA customer-first attitude and team-focused mindset\nAbility to lift up to 35 lbs and stay active throughout your shift\n\nWhat You’ll Get:\n\nHealth Benefits – Medical, dental, and vision coverage\nGenerous PTO – Paid vacation, holidays, and personal days\nPaid Parental Leave – Support when your family grows\nCareer Growth – Leadership development and training opportunities\nWellness Support – Mental health resources and gym memberships\nRecognition Programs – We celebrate your wins and contributions\nInclusive Culture – A welcoming, diverse, and mission-driven team\n\nWeekend and holiday availability is a must—we’re looking for a leader who thrives in a fast-paced retail environment.\n\nReady to lead with heart and hustle?\nApply today and help us turn donations into opportunities!\n\nEqual Employment Opportunity Statement:\n\nGoodwill Central Texas is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, disability status, protected veteran status, gender identity, sexual orientation, or any other characteristic protected by law.\n\nBackground Check Requirement:\n\nEmployment is contingent upon the successful completion of a pre-employment background check. This may include verification of employment history, education, criminal background, and other information relevant to the position.\n\n#IND2",
      "benefits": "Benefits\nPulled from the full job description\nPaid parental leave\nParental leave\nHealth insurance\nPaid time off\nVision insurance\nDental insurance\nGym membership\nShow more\n&nbsp;"
    },
    {
      "title": "Retail Assistant Manager",
      "company": "Goodwill Industries of Central Texas",
      "location": "Cedar Park, TX 78613",
      "salary": "Full-time",
      "url": "https://www.indeed.com/viewjob?jk=456789abcdef0123",
      "job_key": "456789abcdef0123"
    }
  ]
}