{
  "scraped_at": "2025-10-24T11:00:59.498667",
  "source": "Indeed.com",
  "search_query": "Goodwill Central Texas - Austin, TX",
  "total_jobs": 3,
  "jobs": [
    {
      "title": "Adult Literacy Instructor- Contract",
      "company": "Goodwill Industries of Central Texas",
      "location": "Austin, TX",
      "employment_type": "Part-time",
      "job_key": "7e4b335c1a9babda",
      "url": "https://www.indeed.com/viewjob?jk=7e4b335c1a9babda",
      "description": "The Adult Literacy Instructor will support adult English learners. through personalized instruction and will also engage in key program functions such as progress tracking, and curriculum planning.\n\nThis role will employ a student-centered approach, effectively tailoring the instructional strategies to the individual students’ needs and approaching instruction with creativity and innovation.\n\n\nEssential Duties & Responsibilities\n\nDesign and deliver engaging lessons tailored to the needs of students at varying proficiency levels.\nDevelop and adapt teaching materials and resources to suit individual learning objectives.\nEmploye interactive and student-centered teaching methods to enhance language acquisition.\nAssess students' progress through assignments, tests, and oral communication activities learning needs and progress through formal and informal evaluations.\nProvide constructive feedback and strategies for improvement to students\nFoster a positive, inclusive and engaging learning environment.\nStay updated on Adult Literacy teaching best practices and incorporate innovative techniques\nAssess student progress and learning needs to build and shape instruction around student needs.\nCreate a positive classroom environment conducive to learning and educational growth of students, including behavior management that is firm, fair, and consistent.\nTrack and report attendance, testing, and student achievement data.\nCollaborate with team members on curriculum, schedules, and student placement.\nSupport compliance with program requirements through timely data entry and reporting.\nContribute to outreach, orientation, and student engagement activities as needed.\n\n\nSupervisory Responsibility\n\nThis position does not have supervisory responsibilities.\n\n\nRequired Skills & Qualifications\n\nBachelor’s degree in education or a related field.\nTEFL, TESOR, or CELTA certified\nProven record of results that illustrate the teacher’s ability to increase student achievement utilizing subject-specific instructional strategies.\nBroad knowledge of the principles and practices of current educational trends in curriculum and instruction.\nStrong interpersonal and communication skills, with the ability to engage and motivate diverse populations.\nRespect and understanding of students' diverse cultural backgrounds.\nAbility to create an inclusive and welcoming environment.\nAwareness of potential cultural barriers to learning.\n\n\nPhysical Requirements\n\nAbility to work in both a climate and non-climate-controlled facility.\nMust be able to lift up to 20 pounds at times.\nWhile performing the duties of this job, the employee is frequently required to walk; balance; stoop, kneel, crouch, and talk or hear.\nThe ability to cope with and tolerate moderate levels of stress is also a necessity. Specific vision abilities required by this job include close vision, distance vision, depth perception and ability to adjust focus.\n\n\nAdditional Details:\n\nWe are seeking two evening Instructors to join our team, one based in Kyle, Texas and one based in Georgetown, Texas. This role is ideal for individuals passionate about teaching and supporting students as they build skills for success.\n\nSchedule: Two evenings per week\n\nInstruction Hours: 5 hours of teaching per week (each class is 2.5 hours)\nAdditional Time: Instructors should expect to dedicate additional hours outside of classroom teaching for program coordination, lesson preparation, and administrative tasks.\nCourse Length: Each class runs for 12 weeks with two weeks between classes\nLocation: One opening in Kyle, TX; one opening in Georgetown, TX\n\n\nEqual Employment Opportunity Statement:\n\nGoodwill Central Texas is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, disability status, protected veteran status, gender identity, sexual orientation, or any other characteristic protected by law.\n\n\nBackground Check Requirement:\n\nEmployment is contingent upon the successful completion of a pre-employment background check. This may include verification of employment history, education, criminal background, and other information relevant to the position.\n\n#IND2",
      "salary": "$30 - $32 an hour",
      "qualifications": "Required Skills & Qualifications"
    },
    {
      "title": "Logistics Assistant Manager",
      "company": "Goodwill Industries of Central Texas",
      "location": "Austin, TX",
      "job_key": "b0c17377af640b42",
      "url": "https://www.indeed.com/viewjob?jk=b0c17377af640b42",
      "description": "Logistics Assistant Manager – Lead With Purpose + Earn a $750 Sign-On Bonus!\n\nAre you a skilled logistics leader with a passion for safety, technology, and team development? Do you thrive in a fast-paced environment where you can drive operational excellence and make a daily impact? Goodwill Central Texas is seeking a Logistics Assistant Manager to lead and inspire our logistics team while ensuring safe, efficient, and compliant fleet operations that deliver exceptional service to our retail locations.\n\n\nWhat You’ll Do:\n\nAs the Logistics Assistant Manager, you’ll oversee assigned logistics staff and equipment to ensure smooth and safe day-to-day operations. You’ll take ownership of fleet performance, compliance, and scheduling, using modern logistics technology to improve safety, efficiency, and service quality. Your leadership will empower drivers and dispatchers to succeed, while keeping our fleet operations running at top performance.\n\n\nKey Responsibilities:\n\nCoach and train drivers with a strong focus on safety, accuracy, and service — including conducting regular ride-alongs.\nMonitor and report on all incidents in accordance with company safety protocols.\nInspect and maintain assigned fleet equipment (trucks, trailers, GPS units, etc.) and coordinate repairs and preventative maintenance.\nLead scheduling and attendance tracking for assigned staff to ensure timely delivery execution.\nModel and promote exceptional customer service across logistics and partner departments.\nConduct inventory checks on logistics equipment, supplies, and rentals.\nMonitor fuel card usage and fueling procedures.\nAudit logistics processes with a focus on retail, warehouse, and E-Commerce operations.\nSupport the development and implementation of strategies to improve logistics performance, safety, and cost-efficiency.\nTrack key performance indicators including delivery timeliness, safety metrics, and fleet utilization.\nPartner with cross-functional teams to ensure smooth product flow across departments.\nRecruit, train, supervise, and evaluate logistics employees while fostering a positive, professional team environment.\nEnforce high standards for workplace safety, cleanliness, and organization.\nRecommend staffing and fleet adjustments to improve operations and support budget goals.\nMaintain consistent communication and a strong team atmosphere across all departments.\nAttend all required meetings and training sessions.\n\n\nWho You’ll Lead:\n\nYou’ll directly supervise dispatchers, CDL drivers, and non-CDL drivers — guiding their development, performance, and contributions to team success.\n\n\nWhat You Bring:\n\nRequired Qualifications:\n\n5+ years of experience in logistics, warehousing, or distribution center leadership.\nValid Texas driver’s license.\nProficiency with fleet telematics software for real-time driver and safety management.\nExperience with Warehouse Management Systems (WMS), inventory tracking, and logistics software tools.\nStrong communication skills — both verbal and written.\nAnalytical thinker with a knack for using data and technology to solve problems creatively and effectively.\nThis role requires a flexible schedule, including early mornings, evenings, and weekends as needed, to support operational demands and business needs.\n\n\nPreferred Qualifications:\n\nValid Class A CDL with 5+ years of safe driving experience.\nBilingual in English and Spanish.\nCertification in Smith System or a similar defensive driving program.\n\n\nPhysical Requirements:\n\nAbility to lift up to 50 pounds and work in non-climate-controlled environments.\nFrequent walking, kneeling, crouching, and balancing.\nAbility to focus on detailed tasks and adjust to varying work conditions.\nExposure to airborne particles may occur during normal operations.\n\n\nWhy Join Goodwill Central Texas?\n\nWe offer more than just a job — we offer meaningful work that impacts lives across our community. As part of our team, you’ll help create brighter futures while growing your own career in a purpose-driven, inclusive organization.\n\n\nEqual Employment Opportunity Statement:\n\nGoodwill Central Texas is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, disability status, protected veteran status, gender identity, sexual orientation, or any other characteristic protected by law.\n\n\nBackground Check Requirement:\n\nEmployment is contingent upon the successful completion of a pre-employment background check. This may include verification of employment history, education, criminal background, and other information relevant to the position.\n\n#IND2",
      "salary": "$50,000 - $55,000 a year",
      "employment_type": "Full-time",
      "qualifications": "Required Qualifications:"
    },
    {
      "title": "Retail Assistant Manager",
      "company": "Goodwill Industries of Central Texas",
      "location": "Cedar Park, TX",
      "employment_type": "Full-time",
      "job_key": "1db5c23c9b0ed3dc",
      "url": "https://www.indeed.com/viewjob?jk=1db5c23c9b0ed3dc",
      "description": "Assistant Store Manager – Lead With Purpose\n\nQuarterly Bonus Potential: Assistant Store Managers have the potential to earn up to a max of 12.5% of their quarterly salary based on performance in key metrics in their department.\n\nLooking to grow your retail career and earn a bonus while making a real difference in your community? We're hiring an enthusiastic, hands-on Assistant Store Manager to help lead our retail team. You’ll partner with the Retail General Manager to oversee daily operations, guide an amazing team, and create outstanding customer experience. When the GM’s away, you step in to keep everything running smoothly.\n\nWhat You’ll Be Doing:\n\nSupport the Retail GM in leading store operations, staffing, merchandising, and customer service.\nSupervise and mentor retail, donation, and production staff.\nManage scheduling, inventory control, cash handling, and store opening/closing.\nJump in on the floor when needed—assist donors, sort inventory, and serve customers.\nDrive store productivity while maintaining safety, cleanliness, and compliance.\nTake the lead on all store operations in the absence of the General Manager.\n\nWho You’ll Supervise:\n\nSales Associates, Merchandise Processors and Retail Supervisors. Your leadership will make a real impact on team performance and morale.\n\nWhat You Bring:\n\nHigh School diploma or equivalent; college a plus\n5+ years of experience in retail or similar roles\n2+ years in a supervisory or management position\nStrong organizational, scheduling, and communication skills\nA customer-first attitude and team-focused mindset\nAbility to lift up to 35 lbs and stay active throughout your shift\n\nWhat You’ll Get:\n\nHealth Benefits – Medical, dental, and vision coverage\nGenerous PTO – Paid vacation, holidays, and personal days\nPaid Parental Leave – Support when your family grows\nCareer Growth – Leadership development and training opportunities\nWellness Support – Mental health resources and gym memberships\nRecognition Programs – We celebrate your wins and contributions\nInclusive Culture – A welcoming, diverse, and mission-driven team\n\nWeekend and holiday availability is a must—we’re looking for a leader who thrives in a fast-paced retail environment.\n\nReady to lead with heart and hustle?\nApply today and help us turn donations into opportunities!\n\nEqual Employment Opportunity Statement:\n\nGoodwill Central Texas is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, disability status, protected veteran status, gender identity, sexual orientation, or any other characteristic protected by law.\n\nBackground Check Requirement:\n\nEmployment is contingent upon the successful completion of a pre-employment background check. This may include verification of employment history, education, criminal background, and other information relevant to the position.\n\n#IND2",
      "salary": "$42,000 - $47,999 a year",
      "benefits": "Benefits\nPulled from the full job description\nPaid parental leave\nParental leave\nHealth insurance\nPaid time off\nVision insurance\nDental insurance\nGym membership\nShow more\n&nbsp;"
    }
  ]
}